---
kind: type
id: T:Autodesk.Revit.Exceptions.DefaultValueException
source: html/b26719be-e9a8-eab2-3fac-66bc8765febe.htm
---
# Autodesk.Revit.Exceptions.DefaultValueException

The exception thrown when Revit cannot initialize a default value for a family parameter.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class DefaultValueException : InvalidOperationException
```